[
    {
        "title": "Murder Mystery",
        "year": 2019,
        "cast": [
          "Adam Sandler",
          "Jennifer Aniston",
          "Luke Evans",
          "Gemma Arterton",
          "Adeel Akhtar",
          "Terence Stamp"
        ],
        "genres": [
          "Comedy",
          "Mystery"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Murder%20Mystery%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "Murder Mystery is a 2019 American comedy mystery film directed by Kyle Newacheck and written by James Vanderbilt. The film stars Adam Sandler, Jennifer Aniston, and Luke Evans, and follows a married couple who are caught up in a murder investigation on a billionaire's yacht. It was released on June 14, 2019, by Netflix. It received mixed reviews from critics. A sequel was released by Netflix on March 31, 2023.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/19/Murder_Mystery_%28film%29.png",
        "thumbnail_width": 240,
        "thumbnail_height": 355
      },
    {
        "title": "Escape Room",
        "year": 2019,
        "cast": [
          "Taylor Russell",
          "Logan Miller",
          "Deborah Ann Woll",
          "Tyler Labine",
          "Jay Ellis",
          "Nik Dodani",
          "Yorick van Wageningen"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Escape%20Room%20by%20Vj%20Junior.mp4",
        "extract": "Escape Room is a 2019 American psychological horror film directed by Adam Robitel and written by Bragi F. Schut and Maria Melnik. The film stars Taylor Russell, Logan Miller, Deborah Ann Woll, Tyler Labine, Nik Dodani, Jay Ellis, and Yorick van Wageningen, and follows a group of people who are sent to navigate a series of deadly escape rooms.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/99/Escape_Room_%282019_poster%29.png",
        "thumbnail_width": 245,
        "thumbnail_height": 363
      },
      {
        "title": "The Kid Who Would Be King",
        "year": 2019,
        "cast": [
          "Louis Ashbourne Serkis",
          "Dean Chaumoo",
          "Tom Taylor",
          "Rhianna Doris",
          "Angus Imrie",
          "Rebecca Ferguson",
          "Patrick Stewart"
        ],
        "genres": [
          "Action",
          "Adventure",
          "Fantasy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Kid%20Who%20would%20be%20King%20-%20Luganda%20Jr_www.mobifliks.com.mp4",
        "extract": "The Kid Who Would Be King is a 2019 fantasy action-adventure film written and directed by Joe Cornish. A British/American venture, the film stars Louis Ashbourne Serkis, Tom Taylor, Dean Chaumoo, Rhianna Doris, Angus Imrie, Rebecca Ferguson, and Patrick Stewart. The plot follows a young boy who finds King Arthur's legendary sword Excalibur and must use it to stop an ancient enchantress from enslaving the world with help from his classmates from school.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4c/The_Kid_Who_Would_be_King.png",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Serenity",
        "year": 2019,
        "cast": [
          "Matthew McConaughey",
          "Anne Hathaway",
          "Jason Clarke",
          "Diane Lane",
          "Djimon Hounsou"
        ],
        "genres": [
          "Mystery",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Serenity_VJ%20Junior_Mobifliks.com.mp4",
        "extract": "Serenity is a 2019 American mystery thriller film written, produced and directed by Steven Knight. The film stars Matthew McConaughey, Anne Hathaway, Diane Lane, Jason Clarke, Djimon Hounsou, and Jeremy Strong, and follows a fishing boat captain who is approached by his ex-wife to murder her abusive new husband. First announced in January 2017, principal photography on the film began on Mauritius that July.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/46/Serenity_%282019_poster%29.png",
        "thumbnail_width": 250,
        "thumbnail_height": 370
      },
      {
        "title": "I Am Mother",
        "year": 2019,
        "cast": [
          "story)",
          "Clara Rugaard",
          "Rose Byrne",
          "Hilary Swank"
        ],
        "genres": [
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/I%20Am%20Mother%20-%20VJ%20Emmy%20-%20Luganda.mp4",
        "extract": "I Am Mother is a 2019 Australian cyberpunk thriller film directed by Grant Sputore, from a screenplay by Michael Lloyd Green, based on a story by both. Starring Clara Rugaard, Luke Hawker, Rose Byrne, and Hilary Swank, the film follows Daughter, a girl in a post-apocalyptic bunker, being raised by Mother, a robot aiding the repopulation of Earth. The film had its world premiere at the Sundance Film Festival on 25 January 2019. Netflix released it in several countries on 7 June 2019.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a4/I_Am_Mother_poster.png",
        "thumbnail_width": 240,
        "thumbnail_height": 356
      },
      {
        "title": "Glass",
        "year": 2019,
        "cast": [
          "James McAvoy",
          "Bruce Willis",
          "Samuel L. Jackson",
          "Sarah Paulson",
          "Anya Taylor-Joy",
          "Spencer Treat Clark",
          "Charlayne Woodard"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Glass%20-%20VJ%20Mark%20-%20Luganda.mp4",
        "extract": "Glass is a 2019 American superhero film written and directed by M. Night Shyamalan, who also produced with Jason Blum, Marc Bienstock, and Ashwin Rajan. The film is a crossover and sequel to Shyamalan's previous films Unbreakable (2000) and Split (2016) and the third and final installment in the Unbreakable trilogy. Bruce Willis, Samuel L. Jackson, Spencer Treat Clark, and Charlayne Woodard reprise their Unbreakable roles, while James McAvoy and Anya Taylor-Joy return as their Split characters, with Sarah Paulson, Adam David Thompson, and Luke Kirby joining the cast. The film sees David Dunn / The Overseer as he and Kevin Wendell Crumb / The Horde are captured and placed in a psychiatric facility with Elijah Price / Mr. Glass, where they contemplate the authenticity of their superhuman powers.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/01/Glass_%282019_poster%29.png",
        "thumbnail_width": 220,
        "thumbnail_height": 329
      },
      {
        "title": "Close",
        "year": 2019,
        "cast": [
          "Noomi Rapace",
          "Sophie Nélisse",
          "Indira Varma",
          "Eoin Macken"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Close%20-%20Luganda-www.mobifliks.com.mp4",
        "extract": "Close is a 2019 British action thriller film directed by Vicky Jewson and starring Noomi Rapace. Rapace's character is based on that of Jacquie Davis, one of the world's leading female bodyguards, whose clients have included J. K. Rowling, Nicole Kidman and members of the British royal family. The film was released on 18 January 2019 by Netflix.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/dc/Close_poster.jpg",
        "thumbnail_width": 256,
        "thumbnail_height": 386
      },
      {
        "title": "Miss Bala",
        "year": 2019,
        "cast": [
          "Gina Rodriguez",
          "Ismael Cruz Córdova",
          "Anthony Mackie"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Miss%20Bala_www.mobifliks.com.mp4",
        "extract": "Miss Bala is a 2019 action thriller film directed by Catherine Hardwicke and written by Gareth Dunnet-Alcocer, based on the 2011 Mexican film of the same name. The film stars Gina Rodriguez, Ismael Cruz Córdova, and Anthony Mackie, and follows a woman who trains to take down a Mexican drug cartel after her friend is kidnapped.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/aa/Miss_Bala_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "The Prodigy",
        "year": 2019,
        "cast": [
          "Taylor Schilling",
          "Peter Mooney",
          "Colm Feore"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Prodigy%20Luganda%20-%20VJ%20Junior_mobifliks.com.mp4",
        "extract": "The Prodigy is a 2019 horror film directed by Nicholas McCarthy, and written by Jeff Buhler. It stars Taylor Schilling, Jackson Robert Scott and Colm Feore. The plot centers around a child whose disturbing behavior signals that an evil, possibly supernatural being has taken control of him, forcing his parents to investigate whether sinister forces are involved.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/0b/The_Prodigy_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "What Men Want",
        "year": 2019,
        "cast": [
          "Taraji P. Henson",
          "Tracy Morgan",
          "Max Greenfield",
          "Aldis Hodge",
          "Wendi McLendon-Covey"
        ],
        "genres": [
          "Comedy",
          "Romance"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/What%20Men%20Want%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "What Men Want is a 2019 American romantic comedy film directed by Adam Shankman and starring Taraji P. Henson, Aldis Hodge, Josh Brener, Erykah Badu, Richard Roundtree and Tracy Morgan. The film is a loose remake of the 2000 film What Women Want. The plot follows a woman who – after drinking a potent concoction given by a shaman – gains the ability to hear men's inner thoughts. The screenplay was written by Jas Waters and Tina Gordon Chism.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e9/What_Men_Want_2019_Teaser_poster.jpg",
        "thumbnail_width": 260,
        "thumbnail_height": 384
      },
      {
        "title": "Cold Pursuit",
        "year": 2019,
        "cast": [
          "Liam Neeson",
          "Tom Bateman",
          "Tom Jackson",
          "Emmy Rossum",
          "Domenick Lombardozzi",
          "Julia Jones",
          "John Doman",
          "Laura Dern"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Cold%20Pursuit%20-%20Luganda%20VJ%20Emmy_www.mobifliks.com.mp4",
        "extract": "Cold Pursuit is a 2019 action thriller film directed by Hans Petter Moland from a screenplay by Frank Baldwin. A co-production between the United States, the United Kingdom, Canada and France, the film stars Liam Neeson, Tom Bateman, Tom Jackson, Emmy Rossum, Domenick Lombardozzi, Julia Jones, John Doman, and Laura Dern. It is a remake of the 2014 Norwegian film In Order of Disappearance (Kraftidioten), also directed by Moland, and follows a brooding and vengeful snowplow driver (Neeson) who starts killing the members of a drug cartel following the murder of his son.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/54/Cold_Pursuit_poster.jpg",
        "thumbnail_width": 254,
        "thumbnail_height": 390
      },
      {
        "title": "Happy Death Day 2U",
        "year": 2019,
        "cast": [
          "Jessica Rothe",
          "Israel Broussard",
          "Phi Vu",
          "Suraj Sharma",
          "Sarah Yarkin",
          "Ruby Modine",
          "Rachel Matthews",
          "Charles Aitken",
          "Steve Zissis"
        ],
        "genres": [
          "Comedy",
          "Science Fiction",
          "Slasher"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Happy%20Death%20Day%202U%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "Happy Death Day 2U is a 2019 American science fiction black comedy slasher film written and directed by Christopher Landon. A sequel to 2017's Happy Death Day, it stars Jessica Rothe, Israel Broussard, Suraj Sharma, and Steve Zissis. The film again follows Tree Gelbman (Rothe), now trapped in the same time loop of a different iteration of her world. Jason Blum again serves as a producer through his Blumhouse Productions company.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/58/Happy_Death_Day_2U.png",
        "thumbnail_width": 250,
        "thumbnail_height": 376
      },
      {
        "title": "Alita: Battle Angel",
        "year": 2019,
        "cast": [
          "Rosa Salazar",
          "Christoph Waltz",
          "Jennifer Connelly",
          "Mahershala Ali",
          "Ed Skrein",
          "Jackie Earle Haley",
          "Keean Johnson",
          "Leonard Wu"
        ],
        "genres": [
          "Action"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Alita%20-%20Battle%20Angel%20-%20Luganda%20VJ%20Junior.mp4",
        "extract": "Alita: Battle Angel is a 2019 American cyberpunk action film based on Yukito Kishiro's manga series Gunnm. It was directed by Robert Rodriguez, produced by James Cameron and Jon Landau, and written by Cameron and Laeta Kalogridis. Rosa Salazar stars through motion-capture animation as Alita, a cyborg who awakens in a new body without memory of her past and sets out to uncover her destiny. Christoph Waltz, Jennifer Connelly, Mahershala Ali, Ed Skrein, Jackie Earle Haley and Keean Johnson star in supporting roles.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/ee/Alita_Battle_Angel_%282019_poster%29.png",
        "thumbnail_width": 250,
        "thumbnail_height": 370
      },
      {
        "title": "How to Train Your Dragon: The Hidden World",
        "year": 2019,
        "cast": [
          "Jay Baruchel",
          "America Ferrera",
          "Cate Blanchett",
          "Craig Ferguson",
          "F. Murray Abraham"
        ],
        "genres": [
          "Action",
          "Animated",
          "Fantasy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/How%20to%20train%20your%20dragon-Luganda-VJ%20Kevo.mp4",
        "extract": "How to Train Your Dragon: The Hidden World is a 2019 American computer-animated action fantasy film loosely based on the book series by Cressida Cowell. Produced by DreamWorks Animation and distributed by Universal Pictures, it is the sequel to How to Train Your Dragon 2 (2014) and the third and final installment in the How to Train Your Dragon trilogy. Written and directed by Dean DeBlois and produced by Bonnie Arnold and Brad Lewis, the film stars the voices of Jay Baruchel, America Ferrera, Cate Blanchett, Craig Ferguson, and F. Murray Abraham. The film follows Hiccup as he seeks a dragon utopia known as the \"Hidden World\" while coming to terms with Toothless' new bond with a female Fury, as they deal with the threat of a ruthless dragon hunter named Grimmel the Grisly.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fd/How_to_Train_Your_Dragon_3_poster.png",
        "thumbnail_width": 220,
        "thumbnail_height": 348
      },
      {
        "title": "Fighting with My Family",
        "year": 2019,
        "cast": [
          "Florence Pugh",
          "Lena Headey",
          "Nick Frost",
          "Jack Lowden",
          "Vince Vaughn",
          "Dwayne Johnson"
        ],
        "genres": [
          "Comedy",
          "Drama",
          "Sports",
          "Biography"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Fighting%20with%20my%20Family%20-%20Luganda%20-%20Vj%20Junior_x264.mp4",
        "extract": "Fighting with My Family is a 2019 biographical sports comedy-drama film written and directed by Stephen Merchant. Based on the 2012 documentary The Wrestlers: Fighting with My Family by Max Fisher, it depicts the career of English professional wrestler Paige as she makes her way to WWE, while also following her brother Zak Zodiac, as he struggles with his failure to achieve similar success. Florence Pugh and Jack Lowden star as Paige and Zodiac respectively, alongside Lena Headey, Nick Frost, Vince Vaughn, and Dwayne Johnson, with the latter also acting as producer.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/55/Fighting_With_My_Family_poster.png",
        "thumbnail_width": 320,
        "thumbnail_height": 240
      },
      {
        "title": "Triple Frontier",
        "year": 2019,
        "cast": [
          "Ben Affleck",
          "Oscar Isaac",
          "Charlie Hunnam",
          "Garrett Hedlund",
          "Pedro Pascal"
        ],
        "genres": [
          "Action",
          "Adventure"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Tripple%20Frontier%20-%20Luganda_www.mobifliks.com.mp4",
        "extract": "Triple Frontier is a 2019 American action-adventure film directed by J. C. Chandor. Chandor and Mark Boal wrote the screenplay based on a story by Boal. The film stars Ben Affleck, Oscar Isaac, Charlie Hunnam, Garrett Hedlund, and Pedro Pascal as a group of former U.S. Army Delta Force operators who reunite to plan a heist of a South American crime lord.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/80/Triple_Frontier.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Captain Marvel",
        "year": 2019,
        "cast": [
          "Brie Larson",
          "Samuel L. Jackson",
          "Ben Mendelsohn",
          "Djimon Hounsou",
          "Lee Pace",
          "Lashana Lynch",
          "Gemma Chan",
          "Annette Bening",
          "Clark Gregg",
          "Jude Law"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Captain%20Marvel%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "Captain Marvel is a 2019 American superhero film based on Marvel Comics featuring the character Carol Danvers / Captain Marvel. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 21st film in the Marvel Cinematic Universe (MCU). The film was written and directed by Anna Boden and Ryan Fleck, with Geneva Robertson-Dworet also contributing to the screenplay. Brie Larson stars as Carol Danvers, alongside Samuel L. Jackson, Ben Mendelsohn, Djimon Hounsou, Lee Pace, Lashana Lynch, Gemma Chan, Annette Bening, Clark Gregg, and Jude Law. Set in 1995, the story follows Danvers as she becomes Captain Marvel after Earth is caught in the center of a galactic conflict between two alien civilizations.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4e/Captain_Marvel_%28film%29_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "The Kid",
        "year": 2019,
        "cast": [
          "Ethan Hawke",
          "Dane DeHaan",
          "Jake Schur",
          "Leila George",
          "Adam Baldwin",
          "Chris Pratt"
        ],
        "genres": [
          "Western"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Kid%20by%20Vj%20Kevo.mp4",
        "extract": "The Kid is a 2019 American Western film directed by Vincent D'Onofrio, from a screenplay by Andrew Lanham. The film stars Ethan Hawke, Dane DeHaan, Jake Schur, Leila George, Chris Pratt, Adam Baldwin, and Vincent D'Onofrio.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/ac/The_Kid_%282019_film%29.png",
        "thumbnail_width": 250,
        "thumbnail_height": 374
      },
        {
        "title": "Triple Frontier",
        "year": 2019,
        "cast": [
          "Ben Affleck",
          "Oscar Isaac",
          "Charlie Hunnam",
          "Garrett Hedlund",
          "Pedro Pascal"
        ],
        "genres": [
          "Action",
          "Adventure"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Tripple%20Frontier%20-%20Luganda_www.mobifliks.com.mp4",
        "extract": "Triple Frontier is a 2019 American action-adventure film directed by J. C. Chandor. Chandor and Mark Boal wrote the screenplay based on a story by Boal. The film stars Ben Affleck, Oscar Isaac, Charlie Hunnam, Garrett Hedlund, and Pedro Pascal as a group of former U.S. Army Delta Force operators who reunite to plan a heist of a South American crime lord.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/80/Triple_Frontier.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Captain Marvel",
        "year": 2019,
        "cast": [
          "Brie Larson",
          "Samuel L. Jackson",
          "Ben Mendelsohn",
          "Djimon Hounsou",
          "Lee Pace",
          "Lashana Lynch",
          "Gemma Chan",
          "Annette Bening",
          "Clark Gregg",
          "Jude Law"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Captain%20Marvel%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "Captain Marvel is a 2019 American superhero film based on Marvel Comics featuring the character Carol Danvers / Captain Marvel. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 21st film in the Marvel Cinematic Universe (MCU). The film was written and directed by Anna Boden and Ryan Fleck, with Geneva Robertson-Dworet also contributing to the screenplay. Brie Larson stars as Carol Danvers, alongside Samuel L. Jackson, Ben Mendelsohn, Djimon Hounsou, Lee Pace, Lashana Lynch, Gemma Chan, Annette Bening, Clark Gregg, and Jude Law. Set in 1995, the story follows Danvers as she becomes Captain Marvel after Earth is caught in the center of a galactic conflict between two alien civilizations.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4e/Captain_Marvel_%28film%29_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "The Kid",
        "year": 2019,
        "cast": [
          "Ethan Hawke",
          "Dane DeHaan",
          "Jake Schur",
          "Leila George",
          "Adam Baldwin",
          "Chris Pratt"
        ],
        "genres": [
          "Western"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Kid%20by%20Vj%20Kevo.mp4",
        "extract": "The Kid is a 2019 American Western film directed by Vincent D'Onofrio, from a screenplay by Andrew Lanham. The film stars Ethan Hawke, Dane DeHaan, Jake Schur, Leila George, Chris Pratt, Adam Baldwin, and Vincent D'Onofrio.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/ac/The_Kid_%282019_film%29.png",
        "thumbnail_width": 250,
        "thumbnail_height": 374
      },
      {
        "title": "The Silence",
        "year": 2019,
        "cast": [
          "Kiernan Shipka",
          "Stanley Tucci",
          "Miranda Otto",
          "John Corbett"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Silence_www.mobifliks.com-luganda-vj-junior.mp4",
        "extract": "The Silence is a 2019 horror film directed by John R. Leonetti and starring Kiernan Shipka, Stanley Tucci, Miranda Otto, and John Corbett. The screenplay by Carey and Shane Van Dyke adapts the 2015 horror novel of the same name by Tim Lebbon. The film depicts a world under attack by creatures who hunt by sound. Shipka plays a deaf teenager who seeks shelter with her family, and a cult tries to take advantage of her fertility.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/31/The_Silence_2019_film_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Hellboy",
        "year": 2019,
        "cast": [
          "David Harbour",
          "Milla Jovovich",
          "Ian McShane",
          "Sasha Lane",
          "Daniel Dae Kim",
          "Sophie Okonedo",
          "Penelope Mitchell",
          "Thomas Haden Church"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Hellboy%20-%20VJ%20Emmy%20-%20Luganda.mp4",
        "extract": "Hellboy is a 2019 superhero film based on the Dark Horse Comics character of the same name, created by Mike Mignola. A reboot of the Hellboy film series, it is the third live-action adaptation after Hellboy (2004) and Hellboy II: The Golden Army  (2008); directed by Neil Marshall, the film stars David Harbour in the title role, alongside Milla Jovovich, Ian McShane, Sasha Lane, Daniel Dae Kim, and Thomas Haden Church. The film draws inspiration from the comic books Darkness Calls, The Wild Hunt, The Storm and the Fury, and Hellboy in Mexico. In the film, Hellboy struggles with his psyche while preventing a resurrected sorceress from conquering the world.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fc/Hellboy_%282019%29_theatrical_poster.png",
        "thumbnail_width": 240,
        "thumbnail_height": 365
      },
      {
        "title": "Little",
        "year": 2019,
        "cast": [
          "Issa Rae",
          "Regina Hall",
          "Marsai Martin"
        ],
        "genres": [
          "Comedy",
          "Fantasy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Little%20-%20VJ%20Junior%20-%20Luganda_www.mobifliks.com_367MB.mp4",
        "extract": "Little is a 2019 American fantasy comedy film directed and co-written by Tina Gordon. It stars Regina Hall, Issa Rae and Marsai Martin, and follows an overbearing boss who is transformed into the teenager version of herself. Martin serves as an executive producer for the film, and at 13 years old, is the youngest person to ever hold that title on a Hollywood production.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bf/LittlePoster.jpeg",
        "thumbnail_width": 220,
        "thumbnail_height": 348
      },
      {
        "title": "Shazam!",
        "year": 2019,
        "cast": [
          "Zachary Levi",
          "Asher Angel",
          "Mark Strong",
          "Jack Dylan Grazer",
          "Djimon Hounsou"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Shazam!%20Fury%20of%20the%20Gods%20by%20Vj%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Shazam! is a 2019 superhero film based on the DC Comics character of the same name. Produced by New Line Cinema, DC Films, the Safran Company, and Seven Bucks Productions, and distributed by Warner Bros. Pictures, it is the seventh installment in the DC Extended Universe (DCEU). It was directed by David F. Sandberg from a screenplay by Henry Gayden who co-wrote the story with Darren Lemke, and stars Zachary Levi, Mark Strong, Asher Angel, Jack Dylan Grazer, and Djimon Hounsou. The film follows teenager Billy Batson (Angel) as he is chosen by the ancient wizard Shazam (Hounsou) to be his new champion by saying the name \"Shazam\", allowing him to transform into an adult superhero (Levi) with various superpowers. Billy and his foster brother Freddy Freeman (Grazer) must discover Billy's new powers in order to stop the evil Dr. Thaddeus Sivana (Strong) and the Seven Deadly Sins.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c2/Shazam%21_%28film%29_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "Pet Sematary",
        "year": 2019,
        "cast": [
          "Jason Clarke",
          "Amy Seimetz",
          "John Lithgow"
        ],
        "genres": [
          "Horror",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Pet%20Sematary-Luganda-VJ%20Emmy_mobifliks.com.mp4",
        "extract": "Pet Sematary is a 2019 American supernatural horror film directed by Kevin Kölsch and Dennis Widmyer and written by Jeff Buhler, from a screen story by Matt Greenberg. It is the second adaptation of the 1983 novel of the same name by Stephen King, and a remake to the 1989 film. The film stars Jason Clarke, Amy Seimetz, and John Lithgow, and follows a family that discovers a mysterious graveyard in the woods behind their new home, capable of resurrecting the dead.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/41/Pet_Sematary_%282019_poster%29.png",
        "thumbnail_width": 240,
        "thumbnail_height": 375
      },
      {
        "title": "Dumbo",
        "year": 2019,
        "cast": [
          "Colin Farrell",
          "Michael Keaton",
          "Danny DeVito",
          "Eva Green",
          "Nico Parker",
          "Finley Hobbins",
          "Alan Arkin",
          "Roshan Seth",
          "Lars Eidinger",
          "DeObia Oparei"
        ],
        "genres": [
          "Adventure",
          "Fantasy",
          "Historical"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Dumbo%20-%20VJ%20Son%20-%20Mobifliks.com.mp4",
        "extract": "Dumbo is a 2019 American fantasy period adventure film directed by Tim Burton from a screenplay written by Ehren Kruger. The film is a live-action adaptation and reimagining of Walt Disney's 1941 animated film of the same name, which is based on the novel by Helen Aberson and Harold Pearl. The film stars Colin Farrell, Michael Keaton, Danny DeVito, Eva Green and Alan Arkin. The story follows a family that works at a failing traveling circus as they encounter a baby elephant with extremely large ears who is capable of flying.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/91/Dumbo_%282019_film%29.png",
        "thumbnail_width": 254,
        "thumbnail_height": 375
      },
      {
        "title": "Triple Threat",
        "year": 2019,
        "cast": [
          "Tony Jaa",
          "Iko Uwais",
          "Tiger Chen",
          "Scott Adkins",
          "Yanin Vismitananda",
          "Celina Jade",
          "Michael Bisping",
          "Michael Jai White"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Triple%20Treat%20-%20VJ%20Jingo%20-%20Mobifliks.com.mp4",
        "extract": "Triple Threat is a 2019 action thriller film directed by Jesse V. Johnson and starring Tony Jaa, Iko Uwais and Tiger Chen, as well as Scott Adkins, Michael Jai White, Michael Bisping, Celina Jade, and Jeeja Yanin.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/2e/Triple_Threat_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Us",
        "year": 2019,
        "cast": [
          "Lupita Nyong'o",
          "Winston Duke",
          "Shahadi Wright Joseph",
          "Evan Alex",
          "Elisabeth Moss",
          "Tim Heidecker"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/US%20-%20Luganda-VJ%20Mark_mobifliks.com.mp4",
        "extract": "Us is a 2019 American psychological horror film written and directed by Jordan Peele, starring Lupita Nyong'o, Winston Duke, Elisabeth Moss, and Tim Heidecker. The film follows Adelaide Wilson (Nyong'o) and her family, who are attacked by a group of menacing doppelgängers.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/00/Us_%282019%29_theatrical_poster.png",
        "thumbnail_width": 240,
        "thumbnail_height": 380
      },
      {
        "title": "Hotel Mumbai",
        "year": 2019,
        "cast": [
          "Dev Patel",
          "Armie Hammer",
          "Nazanin Boniadi",
          "Tilda Cobham-Hervey",
          "Anupam Kher",
          "Jason Isaacs"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Hotel%20Mumbai%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "Hotel Mumbai is a 2018 action thriller film directed by Anthony Maras and co-written by Maras and John Collee. An Indian-Australian-American co-production, it is inspired by the 2009 documentary Surviving Mumbai about the 2008 Mumbai attacks at the Taj Mahal Palace Hotel in India. The film stars Dev Patel, Armie Hammer, Nazanin Boniadi, Anupam Kher, Tilda Cobham-Hervey, Jason Isaacs, Suhail Nayyar, Nagesh Bhosle, and Natasha Liu Bordizzo.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8b/Hotel_Mumbai_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 311
      },
      {
        "title": "Breakthrough",
        "year": 2019,
        "cast": [
          "Chrissy Metz",
          "Josh Lucas",
          "Topher Grace",
          "Mike Colter",
          "Marcel Ruiz",
          "Sam Trammell",
          "Dennis Haysbert"
        ],
        "genres": [
          "Drama"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Breakthrough%20by%20Vj%20Junior%20-Mobifliks.com.mp4",
        "extract": "Breakthrough is a 2019 American Christian drama film directed by Roxann Dawson in her feature film directorial debut. The film was written by Grant Nieporte, based on the Christian book, The Impossible, an account of true events written by Joyce Smith with Ginger Kolbaba. It stars Chrissy Metz, Josh Lucas, Topher Grace, Mike Colter, Marcel Ruiz, Sam Trammel, and Dennis Haysbert with a cameo by Phil Wickham and Lecrae. Stephen Curry and Samuel Rodriguez are executive producers.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/ea/Breakthrough_%282019_film%29.png",
        "thumbnail_width": 250,
        "thumbnail_height": 396
      },
      {
        "title": "After",
        "year": 2019,
        "cast": [
          "Josephine Langford",
          "Hero Fiennes Tiffin",
          "Selma Blair",
          "Inanna Sarkis",
          "Shane Paul McGhie",
          "Pia Mia",
          "Khadijha Red Thunder",
          "Dylan Arnold",
          "Samuel Larsen",
          "Jennifer Beals",
          "Peter Gallagher"
        ],
        "genres": [
          "Drama",
          "Romance"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/After%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "After is a 2019 American romantic drama film directed by Jenny Gage and written by Gage, Susan McMartin and Tamara Chestna, based on the 2014 novel of the same name by Anna Todd. The film stars Josephine Langford and Hero Fiennes Tiffin and follows an inexperienced teenage girl who begins to romance a mysterious student during her first months of college. The cast includes Selma Blair, Inanna Sarkis, Shane Paul McGhie, Pia Mia, Khadijha Red Thunder, Dylan Arnold, Samuel Larsen, Jennifer Beals and Peter Gallagher in supporting roles.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/62/After_2019_film.png",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "The Curse of La Llorona",
        "year": 2019,
        "cast": [
          "Linda Cardellini",
          "Raymond Cruz",
          "Patricia Velasquez"
        ],
        "genres": [
          "Horror",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/La%20Llorona%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "The Curse of La Llorona is a 2019 American supernatural horror film directed by Michael Chaves, in his feature directorial debut, and written by Mikki Daughtry and Tobias Iaconis. It is the sixth installment in The Conjuring Universe franchise. Based on the Latin American folklore of La Llorona, the film stars Linda Cardellini, Raymond Cruz, and Patricia Velásquez, and follows a mother in 1973 Los Angeles who must save her children from a malevolent spirit trying to steal them. The film was produced by James Wan through his Atomic Monster Productions banner.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/36/The_curse_of_la_llorona_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Avengers: Endgame Part 1",
        "year": 2019,
        "cast": [
          "Robert Downey Jr.",
          "Chris Evans",
          "Mark Ruffalo",
          "Chris Hemsworth",
          "Scarlett Johansson",
          "Jeremy Renner",
          "Don Cheadle",
          "Paul Rudd",
          "Brie Larson",
          "Karen Gillan",
          "Danai Gurira",
          "Benedict Wong",
          "Jon Favreau",
          "Bradley Cooper",
          "Gwyneth Paltrow",
          "Josh Brolin"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Avengers%20Endgame%20Part%202%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "Avengers: Endgame is a 2019 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the direct sequel to Avengers: Infinity War (2018) and the 22nd film in the Marvel Cinematic Universe (MCU). Directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, the film features an ensemble cast including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Benedict Wong, Jon Favreau, Bradley Cooper, Gwyneth Paltrow, and Josh Brolin. In the film, the surviving members of the Avengers and their allies attempt to reverse Thanos's actions in Infinity War.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/0d/Avengers_Endgame_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Avengers: Endgame Part 2",
        "year": 2019,
        "cast": [
          "Robert Downey Jr.",
          "Chris Evans",
          "Mark Ruffalo",
          "Chris Hemsworth",
          "Scarlett Johansson",
          "Jeremy Renner",
          "Don Cheadle",
          "Paul Rudd",
          "Brie Larson",
          "Karen Gillan",
          "Danai Gurira",
          "Benedict Wong",
          "Jon Favreau",
          "Bradley Cooper",
          "Gwyneth Paltrow",
          "Josh Brolin"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Avengers%20Endgame%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "Avengers: Endgame is a 2019 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the direct sequel to Avengers: Infinity War (2018) and the 22nd film in the Marvel Cinematic Universe (MCU). Directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, the film features an ensemble cast including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Benedict Wong, Jon Favreau, Bradley Cooper, Gwyneth Paltrow, and Josh Brolin. In the film, the surviving members of the Avengers and their allies attempt to reverse Thanos's actions in Infinity War.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/0d/Avengers_Endgame_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "I am Mother",
        "year": 2019,
        "cast": [
          "Edward Norton",
          "Bruce Willis",
          "Gugu Mbatha-Raw",
          "Bobby Cannavale",
          "Cherry Jones",
          "Alec Baldwin",
          "Willem Dafoe"
        ],
        "genres": [
          "Crime",
          "Noir",
          "War"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/I%20Am%20Mother%20-%20VJ%20Emmy%20-%20Luganda.mp4",
        "extract": "In the wake of humanitys extinction, a teenage girl is raised by a robot designed to repopulate the earth. But their unique bond is threatened when an inexplicable stranger arrives with alarming news.",
        "thumbnail": "https://www.mobifliks.com/scripts/timthumb2.php?src=https://www.mobifliks.com/admin/thumbs/I%20Am%20Mother%20(2019).jpg&h=220&w=140&a=t&zc=1",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "You are not My Mother",
        "year": 2019,
        "cast": [
          "Edward Norton",
          "Bruce Willis",
          "Gugu Mbatha-Raw",
          "Bobby Cannavale",
          "Cherry Jones",
          "Alec Baldwin",
          "Willem Dafoe"
        ],
        "genres": [
          "Crime",
          "Noir",
          "War"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/You%20Are%20Not%20My%20Mother%20by%20Vj%20Muba%20-%20Mobifliks.com.mp4",
        "extract": "In a North Dublin housing estate Chars mother goes missing. When she returns Char is determined to uncover the truth of her disappearance and unearth the dark secrets of her family.",
        "thumbnail": "https://www.mobifliks.com/scripts/timthumb2.php?src=https://www.mobifliks.com/admin/thumbs/You%20Are%20Not%20My%20Mother%20(2021).jpg&h=220&w=140&a=t&zc=1",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Motherly",
        "year": 2019,
        "cast": [
          "Edward Norton",
          "Bruce Willis",
          "Gugu Mbatha-Raw",
          "Bobby Cannavale",
          "Cherry Jones",
          "Alec Baldwin",
          "Willem Dafoe"
        ],
        "genres": [
          "Crime",
          "Noir",
          "War"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Motherly%20by%20Vj%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Kate (Lora Burke) and her daughter Beth live alone in an isolated farmhouse in the woods, but when Kate slowly begins to suspect that something sinister is happening, her motherly instincts are put to the test.",
        "thumbnail": "https://www.mobifliks.com/scripts/timthumb2.php?src=https://www.mobifliks.com/admin/thumbs/Motherly%20(2021.jpg&h=220&w=140&a=t&zc=1",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Men in Black: International by Vj Junior",
        "year": 2019,
        "cast": [
          "Chris Hemsworth",
          "Tessa Thompson",
          "Kumail Nanjiani",
          "Rebecca Ferguson",
          "Rafe Spall",
          "Les Twins",
          "Emma Thompson",
          "Liam Neeson"
        ],
        "genres": [
          "Action",
          "Comedy",
          "Science Fiction"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Men%20in%20Black%20International%20-%20Mobifliks.com.mp4",
        "extract": "Men in Black: International is a 2019 American science fiction action comedy film directed by F. Gary Gray and written by Art Marcum and Matt Holloway. It is the fourth installment in the Men in Black film series, serving as a stand-alone sequel set in the same universe as the previous films; it is the first film in the series to not feature Will Smith or Tommy Lee Jones as the main characters. It is loosely based on the Malibu/Marvel comic book series of the same name by Lowell Cunningham. The film stars Chris Hemsworth, Tessa Thompson, Kumail Nanjiani, Rebecca Ferguson, Rafe Spall, Laurent and Larry Bourgeois, and Liam Neeson. Emma Thompson reprises her role from the third film, while Tim Blaney returns to voice Frank the Pug from the first two installments. The film follows the Men in Black taking on its biggest threat: a mole in the agency.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1b/Men_in_Black_International_%28Official_Film_Poster%29.png",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Men in Black: International",
        "year": 2019,
        "cast": [
          "Chris Hemsworth",
          "Tessa Thompson",
          "Kumail Nanjiani",
          "Rebecca Ferguson",
          "Rafe Spall",
          "Les Twins",
          "Emma Thompson",
          "Liam Neeson"
        ],
        "genres": [
          "Action",
          "Comedy",
          "Science Fiction"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Men%20in%20Black%20-%20International%20-VJ%20Emmy%20-%20Luganda.mp4",
        "extract": "Men in Black: International is a 2019 American science fiction action comedy film directed by F. Gary Gray and written by Art Marcum and Matt Holloway. It is the fourth installment in the Men in Black film series, serving as a stand-alone sequel set in the same universe as the previous films; it is the first film in the series to not feature Will Smith or Tommy Lee Jones as the main characters. It is loosely based on the Malibu/Marvel comic book series of the same name by Lowell Cunningham. The film stars Chris Hemsworth, Tessa Thompson, Kumail Nanjiani, Rebecca Ferguson, Rafe Spall, Laurent and Larry Bourgeois, and Liam Neeson. Emma Thompson reprises her role from the third film, while Tim Blaney returns to voice Frank the Pug from the first two installments. The film follows the Men in Black taking on its biggest threat: a mole in the agency.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1b/Men_in_Black_International_%28Official_Film_Poster%29.png",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Shaft",
        "year": 2019,
        "cast": [
          "Samuel L. Jackson",
          "Jessie Usher",
          "Richard Roundtree",
          "Alexandra Shipp",
          "Regina Hall",
          "Matt Lauria",
          "Titus Welliver",
          "Method Man"
        ],
        "genres": [
          "Action",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Shaft%20-%20VJ%20Emmy%20-%20Luganda.mp4",
        "extract": "Shaft is a 2019 American action comedy film directed by Tim Story and written by Kenya Barris and Alex Barnow. The film stars Samuel L. Jackson, Jessie T. Usher, Regina Hall, and Richard Roundtree. It is the fifth film in the Shaft series and a direct sequel to the 2000 film with the same title.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b6/Shaft_%282019%29_film_poster.png",
        "thumbnail_width": 257,
        "thumbnail_height": 381
      },
    {
        "title": "6 Underground",
        "year": 2019,
        "cast": [
          "Ryan Reynolds",
          "Mélanie Laurent",
          "Manuel Garcia-Rulfo",
          "Adria Arjona",
          "Payman Maadi",
          "Corey Hawkins",
          "Ben Hardy",
          "Dave Franco"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/6%20Underground%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "6 Underground is a 2019 American vigilante action thriller film directed by Michael Bay and written by Paul Wernick and Rhett Reese. The film stars Ryan Reynolds, Mélanie Laurent, Manuel Garcia-Rulfo, Adria Arjona, Corey Hawkins, Ben Hardy and Dave Franco. Bay produced the film with his longtime business partner Ian Bryce and Skydance's David Ellison, Dana Goldberg and Don Granger. It follows a group of people that fake their deaths and decide to form a vigilante team in order to stage a coup d'état against a ruthless dictator.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/86/6_Underground_%28film%29.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Terminator: Dark Fate",
        "year": 2019,
        "cast": [
          "Linda Hamilton",
          "Arnold Schwarzenegger",
          "Mackenzie Davis",
          "Natalia Reyes",
          "Gabriel Luna",
          "Diego Boneta"
        ],
        "genres": [
          "Action",
          "Science Fiction"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Terminator%20Dark%20Fate_VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Terminator: Dark Fate is a 2019 American science fiction action film directed by Tim Miller and written by David Goyer, Justin Rhodes and Billy Ray from a story by James Cameron, Charles Eglee, Josh Friedman, Goyer and Rhodes. Cameron also produced the film with David Ellison. It is the sixth installment in the Terminator franchise and a direct sequel to Terminator 2: Judgment Day (1991), ignoring the events of Terminator 3: Rise of the Machines (2003), Terminator Salvation (2009) and Terminator Genisys (2015), following the return of creative control to Cameron.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/5f/Terminator_Dark_Fate_poster.jpg",
        "thumbnail_width": 253,
        "thumbnail_height": 395
      },
      {
        "title": "Prey",
        "year": 2019,
        "cast": [
          "Logan Miller",
          "Kristine Froseth"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Prey%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Prey is a 2019 American horror film directed by Franck Khalfoun and written by David Coggeshall and Khalfoun. It stars Logan Miller and Kristine Froseth. Jason Blum is serving as a producer through his Blumhouse Productions banner and Ashok Amritraj is producing through his Hyde Park Entertainment banner.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8f/Prey_%282019_film%29.jpg",
        "thumbnail_width": 260,
        "thumbnail_height": 382
      },
      {
        "title": "10 Minutes Gone",
        "year": 2019,
        "cast": [
          "Bruce Willis",
          "Michael Chiklis"
        ],
        "genres": [
          "Action",
          "Crime",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/10%20Minutes%20Gone%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "10 Minutes Gone is a 2019 crime thriller action film directed by Brian A. Miller. The film stars Bruce Willis and Michael Chiklis, and was released on September 27, 2019.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/ec/10_Minutes_Gone_%282019%29_Film_Poster.jpg",
        "thumbnail_width": 237,
        "thumbnail_height": 350
      },
      {
        "title": "It Chapter Two",
        "year": 2019,
        "cast": [
          "James McAvoy",
          "Jessica Chastain",
          "Bill Hader",
          "Isaiah Mustafa",
          "Jay Ryan",
          "James Ransone",
          "Andy Bean",
          "Jaeden Martell",
          "Sophia Lillis",
          "Finn Wolfhard",
          "Chosen Jacobs",
          "Jeremy Ray Taylor",
          "Jack Dylan Grazer",
          "Wyatt Oleff",
          "Bill Skarsgård"
        ],
        "genres": [
          "Horror",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/IT%20Chapter%20One%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "It Chapter Two is a 2019 American supernatural horror film directed by Andy Muschietti from a screenplay by Gary Dauberman. It is the sequel to It (2017) and the second of a two-part adaptation of the 1986 novel It by Stephen King, primarily covering the second chronological half of the book. The film stars Jessica Chastain, James McAvoy, Bill Hader, Isaiah Mustafa, Jay Ryan, James Ransone, Andy Bean, and Bill Skarsgård as Pennywise. Set in 2016, 27 years after the events of the previous film, the story centers on the Losers Club and their relationships as they reunite to destroy It once and for all.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/88/ItChapterTwoTeaser.jpg",
        "thumbnail_width": 258,
        "thumbnail_height": 383
      },
      {
        "title": "Overcomer",
        "year": 2019,
        "cast": [
          "Alex Kendrick",
          "Priscilla Shirer",
          "Ben Davies",
          "Shari Rigby",
          "Jack Sterner"
        ],
        "genres": [
          "Drama"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Overcomer.VJ%20Junior.mobifiliks.com.414mb.mp4",
        "extract": "Overcomer is a 2019 American Christian drama film directed by Alex Kendrick, who co-wrote the script with Stephen Kendrick. It is the Kendrick brothers' sixth film and their second through their subsidiary, Kendrick Brothers Productions. The film was released by Sony Pictures Releasing on August 23, 2019.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/24/Overcomer_promotional_poster.png",
        "thumbnail_width": 194,
        "thumbnail_height": 290
      },
      {
        "title": "Jacob's Ladder",
        "year": 2019,
        "cast": [
          "Michael Ealy",
          "Jesse Williams",
          "Nicole Beharie"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Jacobs.ladder.mobifliks.com.303mb.mp4",
        "extract": "Jacob's Ladder is a 2019 American psychological horror film directed by David M. Rosenthal and written by Jeff Buhler and Sarah Thorp. A remake of the 1990 film of the same name, it stars Michael Ealy, Jesse Williams, Nicole Beharie, Karla Souza, and Guy Burnet. It was broadcast on DISH Network on July 25, 2019, before the theatrical release on August 23, 2019, by Vertical Entertainment, to mostly negative reviews.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b5/JacobsLadder2019Poster.jpeg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Stuber",
        "year": 2019,
        "cast": [
          "Kumail Nanjiani",
          "Dave Bautista",
          "Iko Uwais",
          "Natalie Morales",
          "Betty Gilpin",
          "Jimmy Tatro",
          "Mira Sorvino",
          "Karen Gillan"
        ],
        "genres": [
          "Action",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Stubber%20-%20VJ%20Junior%20%20-%20Mobifliks.com.mp4",
        "extract": "Stuber is a 2019 American buddy cop action comedy film directed by Michael Dowse and written by Tripper Clancy. Its plot follows a mild-mannered Uber driver named Stu who picks up a passenger who turns out to be a cop hot on the trail of a brutal killer. Iko Uwais, Natalie Morales, Betty Gilpin, Jimmy Tatro, Mira Sorvino, and Karen Gillan also star.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9d/Stuber_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Crawl",
        "year": 2019,
        "cast": [
          "Kaya Scodelario",
          "Barry Pepper"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Crawl%20-%20VJ%20Emmy_Luganda_Mobiflks.com.mp4",
        "extract": "Crawl is a 2019 American natural horror film directed by Alexandre Aja, written by brothers Michael and Shawn Rasmussen, and produced by Sam Raimi. It stars Kaya Scodelario and Barry Pepper as a daughter and father who, along with their dog, find themselves trapped in the crawl space of their home and preyed upon by alligators during a Category 5 hurricane in Florida.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/09/Crawl_%282019_film%29_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "Anna by Vj Junior",
        "year": 2019,
        "cast": [
          "Sasha Luss",
          "Helen Mirren",
          "Luke Evans",
          "Cillian Murphy",
          "Alexander Petrov"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Anna%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Anna is a 2019 action thriller film written, produced and directed by Luc Besson. The film stars Sasha Luss as the eponymous assassin, alongside Luke Evans, Cillian Murphy, Helen Mirren, and Alexander Petrov.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f1/Anna_film_poster.jpg",
        "thumbnail_width": 258,
        "thumbnail_height": 387
      },
      {
        "title": "Anna by Vj Kevin",
        "year": 2019,
        "cast": [
          "Sasha Luss",
          "Helen Mirren",
          "Luke Evans",
          "Cillian Murphy",
          "Alexander Petrov"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Anna%20-%20VJ%20Kevin%20-%20Luganda%20-%20Mobifliks.com.mp4",
        "extract": "Anna is a 2019 action thriller film written, produced and directed by Luc Besson. The film stars Sasha Luss as the eponymous assassin, alongside Luke Evans, Cillian Murphy, Helen Mirren, and Alexander Petrov.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f1/Anna_film_poster.jpg",
        "thumbnail_width": 258,
        "thumbnail_height": 387
      },
      {
        "title": "Child's Play",
        "year": 2019,
        "cast": [
          "Aubrey Plaza",
          "Gabriel Bateman",
          "Brian Tyree Henry",
          "Mark Hamill"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Childs%20Play%20-%20VJ%20Junior%20-Mobifliks.com.mp4",
        "extract": "Child's Play is a 2019 horror film directed by Lars Klevberg from a screenplay written by Tyler Burton Smith. Serving both as a remake of the 1988 film of the same name and a reboot of the Child's Play franchise, the film stars Aubrey Plaza, Gabriel Bateman, Brian Tyree Henry, and Mark Hamill as the voice of Chucky. It follows a family terrorized by a high-tech doll who develops self-awareness and becomes subsequently hostile and murderous.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/39/Child%27s_Play_%282019_film%29.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Annabelle Comes Home",
        "year": 2019,
        "cast": [
          "Mckenna Grace",
          "Madison Iseman",
          "Katie Sarife",
          "Patrick Wilson",
          "Vera Farmiga"
        ],
        "genres": [
          "Horror",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Annabelle%20Comes%20Home%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Annabelle Comes Home is a 2019 American supernatural horror film written and directed by Gary Dauberman, in his directorial debut, from a story by Dauberman and James Wan, who also served as producer with Peter Safran. It serves as a sequel to 2014's Annabelle and 2017's Annabelle: Creation, and as the seventh installment in The Conjuring Universe franchise. The film stars Mckenna Grace, Madison Iseman, and Katie Sarife, along with Vera Farmiga and Patrick Wilson, who reprise their roles as Ed and Lorraine Warren.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/50/AnnabelleComesHomePoster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "The Perfection",
        "year": 2019,
        "cast": [
          "Allison Williams",
          "Logan Browning",
          "Steven Weber",
          "Alaina Huffman"
        ],
        "genres": [
          "Horror",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Perfection%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "The Perfection is a 2018 American psychological horror thriller film directed by Richard Shepard, from a screenplay by Shepard, Nicole Snyder and Eric C. Charmelo. It stars Allison Williams, Logan Browning and Steven Weber.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/82/The_Perfection_film_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Brightburn",
        "year": 2019,
        "cast": [
          "Elizabeth Banks",
          "David Denman",
          "Jackson A. Dunn",
          "Matt Jones",
          "Meredith Hagner"
        ],
        "genres": [
          "Horror",
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Brightburn%20-%20VJ%20Junior%20-%20Luganda-253MB.mp4",
        "extract": "Brightburn is a 2019 American superhero horror film directed by David Yarovesky, written by Brian and Mark Gunn, and produced by James Gunn and Kenneth Huang. Starring Elizabeth Banks, David Denman, Jackson A. Dunn, Matt Jones and Meredith Hagner, the plot follows Brandon Breyer, a young boy of extraterrestrial origin reared on Earth who discovers he has superpowers, using them with dark intentions. The film was produced and financed by Screen Gems, Stage 6 Films, The H Collective and Troll Court Entertainment.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fa/Brightburn_film_poster.png",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "The Sun Is Also a Star",
        "year": 2019,
        "cast": [
          "Yara Shahidi",
          "Charles Melton",
          "John Leguizamo"
        ],
        "genres": [
          "Drama",
          "Teen",
          "Erotic"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Sun%20Is%20Also%20a%20Star%202019%20-%20Luganda%20VJ%20Junior.mp4",
        "extract": "The Sun Is Also a Star is a 2019 American teen drama film directed by Ry Russo-Young and written by Tracy Oliver, based on the young adult novel of the same name by Nicola Yoon. The film stars Yara Shahidi, Charles Melton, and John Leguizamo, and follows a young couple who fall in love, while one of their families faces deportation.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fb/The_Sun_Is_Also_a_Star_film_poster.png",
        "thumbnail_width": 250,
        "thumbnail_height": 386
      },
      {
        "title": "The Hustle",
        "year": 2019,
        "cast": [
          "Anne Hathaway",
          "Rebel Wilson",
          "Alex Sharp",
          "Dean Norris"
        ],
        "genres": [
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Hustle%20-%20VJ%20Emmy%20-%20Luganda%20-%20www.mobifliks.com.mp4",
        "extract": "The Hustle is a 2019 American comedy film directed by Chris Addison, starring Anne Hathaway, Rebel Wilson, and Alex Sharp. It was written by Stanley Shapiro, Paul Henning, Dale Launer, and Jac Schaeffer. It is a female-centered remake of the 1988 film Dirty Rotten Scoundrels, which is a remake of the 1964 film Bedtime Story. The film follows two women who set out to con an Internet millionaire.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/3a/The_Hustle_film_poster.png",
        "thumbnail_width": 245,
        "thumbnail_height": 359
      },
      {
        "title": "The Intruder",
        "year": 2019,
        "cast": [
          "Dennis Quaid",
          "Michael Ealy",
          "Meagan Good",
          "Joseph Sikora"
        ],
        "genres": [
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Intruder%20-%20VJ%20Emmy%20-%20Luganda_www.mobifliks.com_298MB.mp4",
        "extract": "The Intruder is a 2019 American psychological thriller film directed by Deon Taylor and written by David Loughery. The film stars Michael Ealy and Meagan Good as a couple who buy a house in the country, only to realize its previous owner refuses to let it go. It was released in the United States on May 3, 2019, by Sony Pictures Releasing, receiving generally negative reviews from critics. However, it was a commercial success, grossing $40 million worldwide against its $8 million budget.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4e/The_Intruder_%282019_film%29_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "The Hate U Give",
        "year": 2018,
        "cast": [
          "Amandla Stenberg",
          "Regina Hall",
          "Russell Hornsby",
          "KJ Apa",
          "Algee Smith",
          "Lamar Johnson",
          "Issa Rae",
          "Sabrina Carpenter",
          "Common",
          "Anthony Mackie"
        ],
        "genres": [
          "Drama"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Hate%20U%20Give%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "The Hate U Give is a 2018 American drama film co-produced and directed by George Tillman Jr. from a screenplay by Audrey Wells, based on the 2017 young adult novel of the same name by Angie Thomas. The film was produced by Marty Bowen, Wyck Godfrey, Robert Teitel and Tillman Jr., and stars Amandla Stenberg, Regina Hall, Russell Hornsby, KJ Apa, Sabrina Carpenter, Common, and Anthony Mackie, and follows the fallout after a high school student witnesses a police shooting.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bc/The_Hate_U_Give_poster.png",
        "thumbnail_width": 240,
        "thumbnail_height": 355
      },
      {
        "title": "Ma",
        "year": 2019,
        "cast": [
          "Octavia Spencer",
          "Juliette Lewis",
          "Diana Silvers",
          "McKaley Miller",
          "Corey Fogelmanis",
          "Luke Evans"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Ma%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Ma is a 2019 American psychological horror film, co-produced and directed by Tate Taylor. It stars Octavia Spencer, Juliette Lewis, Diana Silvers, Corey Fogelmanis, Gianni Paolo, McKaley Miller and Luke Evans and follows a group of teenagers who befriend a lonely middle-aged woman. She lets them party in her basement, and they end up being terrorized by her. The film was produced by Jason Blum through his Blumhouse Productions company, along with Tate Taylor and John Norris.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f4/Ma_Official_Movie_Poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 329
      },
      {
        "title": "Godzilla: King of the Monsters",
        "year": 2019,
        "cast": [
          "Kyle Chandler",
          "Vera Farmiga",
          "Millie Bobby Brown",
          "Bradley Whitford",
          "Sally Hawkins",
          "Charles Dance",
          "Thomas Middleditch",
          "Aisha Hinds",
          "O'Shea Jackson Jr.",
          "David Strathairn",
          "Ken Watanabe",
          "Zhang Ziyi"
        ],
        "genres": [],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Godzilla%20King%20of%20the%20Monsters%20-%20Luganda%20-VJ%20Junior.mp4",
        "extract": "Godzilla: King of the Monsters is a 2019 American monster film directed and co-written by Michael Dougherty. A sequel to Godzilla (2014); it is the 35th film in the Godzilla franchise, the third film in Legendary Pictures' MonsterVerse, and the third Godzilla film to be completely produced by a Hollywood studio. The film stars Kyle Chandler, Vera Farmiga, Millie Bobby Brown, Bradley Whitford, Sally Hawkins, Charles Dance, Thomas Middleditch, Aisha Hinds, O'Shea Jackson Jr., David Strathairn, Ken Watanabe, and Zhang Ziyi. In the film, eco-terrorists release King Ghidorah, who awakens other monsters known as \"Titans\" across the world, forcing Godzilla and Mothra to surface and engage Ghidorah and Rodan in a decisive battle.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9a/Godzilla_%E2%80%93_King_of_the_Monsters_%282019%29_poster.png",
        "thumbnail_width": 235,
        "thumbnail_height": 348
      },
      {
        "title": "The Secret Life of Pets 2",
        "year": 2019,
        "cast": [
          "Patton Oswalt",
          "Eric Stonestreet",
          "Kevin Hart",
          "Jenny Slate",
          "Tiffany Haddish",
          "Lake Bell",
          "Nick Kroll",
          "Dana Carvey",
          "Ellie Kemper",
          "Chris Renaud",
          "Hannibal Buress",
          "Bobby Moynihan",
          "Harrison Ford"
        ],
        "genres": [
          "Animated",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Secret%20Life%20of%20Pets%202_VJ%20Kevo_luganda_www.mobifliks.com.mp4",
        "extract": "The Secret Life of Pets 2 is a 2019 American computer-animated comedy film produced by Illumination, directed by Chris Renaud, co-directed by Jonathan del Val, and written by Brian Lynch. It is the sequel to The Secret Life of Pets, and the second feature film in the franchise. The film features the voices of Patton Oswalt, Eric Stonestreet, Jenny Slate, Kevin Hart, Lake Bell, Nick Kroll, Dana Carvey, Ellie Kemper, Chris Renaud, Hannibal Buress, Bobby Moynihan, Tiffany Haddish, and Harrison Ford.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/eb/The_Secret_Life_of_Pets_2_%282019%29_Final_Poster.jpg",
        "thumbnail_width": 251,
        "thumbnail_height": 397
      },
      {
        "title": "Spider-Man: Far From Home",
        "year": 2019,
        "cast": [
          "Tom Holland",
          "Samuel L. Jackson",
          "Zendaya",
          "Cobie Smulders",
          "Jon Favreau",
          "J. B. Smoove",
          "Jacob Batalon",
          "Martin Starr",
          "Marisa Tomei",
          "Jake Gyllenhaal"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Spider-Man-%20Far%20from%20Home%20by%20Vj%20Junior%20-Mobifliks.com.mp4",
        "extract": "Spider-Man: Far From Home is a 2019 American superhero film based on the Marvel Comics character Spider-Man, co-produced by Columbia Pictures and Marvel Studios, and distributed by Sony Pictures Releasing. It is the sequel to Spider-Man: Homecoming (2017) and the 23rd film in the Marvel Cinematic Universe (MCU). The film was directed by Jon Watts, written by Chris McKenna and Erik Sommers, and stars Tom Holland as Peter Parker / Spider-Man, alongside Samuel L. Jackson, Zendaya, Cobie Smulders, Jon Favreau, J. B. Smoove, Jacob Batalon, Martin Starr, Tony Revolori, Marisa Tomei, and Jake Gyllenhaal. In the film, Parker is recruited by Nick Fury (Jackson) and Mysterio (Gyllenhaal) to face the Elementals while he is on a school trip to Europe.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bd/Spider-Man_Far_From_Home_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Escape Plan: The Extractors by Vj Junior",
        "year": 2019,
        "cast": [
          "Sylvester Stallone",
          "Curtis Jackson",
          "Dave Bautista"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Escape%20Plan-%20The%20Extractors%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Escape Plan: The Extractors is a 2019 American direct-to-video prison action thriller film directed and co-written by John Herzfeld, and a sequel to Escape Plan (2013) and Escape Plan 2: Hades (2018). It is the third and final installment in the Escape Plan film series. The film features Sylvester Stallone, 50 Cent, Dave Bautista and Jaime King reprising their roles from the previous films with Max Zhang, Harry Shum, Jr., Malese Jow and Devon Sawa joining the cast. The film was released straight-to-DVD in the United States on July 2, 2019, but received theatrical releases in such countries as Russia, Italy, Australia, Turkey and Portugal.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/40/Escape_Plan_-_The_Extractors_poster.png",
        "thumbnail_width": 290,
        "thumbnail_height": 344
      },
      {
        "title": "Escape Plan: The Extractors by Vj Emmy",
        "year": 2019,
        "cast": [
          "Sylvester Stallone",
          "Curtis Jackson",
          "Dave Bautista"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Escape%20Plan%203%20-%20VJ%20Emmy%20-%20Luganda.mp4",
        "extract": "Escape Plan: The Extractors is a 2019 American direct-to-video prison action thriller film directed and co-written by John Herzfeld, and a sequel to Escape Plan (2013) and Escape Plan 2: Hades (2018). It is the third and final installment in the Escape Plan film series. The film features Sylvester Stallone, 50 Cent, Dave Bautista and Jaime King reprising their roles from the previous films with Max Zhang, Harry Shum, Jr., Malese Jow and Devon Sawa joining the cast. The film was released straight-to-DVD in the United States on July 2, 2019, but received theatrical releases in such countries as Russia, Italy, Australia, Turkey and Portugal.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/40/Escape_Plan_-_The_Extractors_poster.png",
        "thumbnail_width": 290,
        "thumbnail_height": 344
      },
      {
        "title": "Skin",
        "year": 2019,
        "cast": [
          "Jamie Bell",
          "Danielle Macdonald",
          "Daniel Henshall",
          "Bill Camp",
          "Louisa Krause",
          "Mike Colter",
          "Kylie Rogers",
          "Vera Farmiga"
        ],
        "genres": [
          "Drama",
          "Biography"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Skin%20Trade%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": " After his family is killed by a Serbian gangster with international interests, NYC detective Nick goes to S.E. Asia and teams up with a Thai detective to get revenge and destroy the syndicates human trafficking network.",
        "thumbnail": "https://www.mobifliks.com/scripts/timthumb2.php?src=https://www.mobifliks.com/admin/thumbs/Skin-Trade-(2014).jpg&h=220&w=140&a=t&zc=1",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "The Red Sea Diving Resort",
        "year": 2019,
        "cast": [
          "Chris Evans",
          "Haley Bennett",
          "Michael K. Williams",
          "Michiel Huisman",
          "Alessandro Nivola",
          "Greg Kinnear",
          "Ben Kingsley"
        ],
        "genres": [
          "Spy",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Red%20Sea%20Diving%20Resort%20-%20VJ%20Jingo_Luganda-mobifliks.com.mp4",
        "extract": "The Red Sea Diving Resort is a 2019 spy thriller film written and directed by Gideon Raff. The film stars Chris Evans as an Israeli Mossad agent who runs a covert operation that attempts to rescue Ethiopian-Jewish refugees from Sudan to safe haven in Israel. Michael K. Williams, Haley Bennett, Alessandro Nivola, Michiel Huisman, Chris Chalk, Greg Kinnear, and Ben Kingsley are in supporting roles.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/3a/The_Red_Sea_Diving_Resort.jpeg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Fast & Furious Presents: Hobbs & Shaw",
        "year": 2019,
        "cast": [
          "Dwayne Johnson",
          "Jason Statham",
          "Idris Elba",
          "Vanessa Kirby",
          "Eiza González",
          "Cliff Curtis",
          "Helen Mirren"
        ],
        "genres": [
          "Action",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Hobbs%20and%20Shaw_VJ%20Junior_luganda.mp4",
        "extract": "Fast & Furious Presents: Hobbs & Shaw is a 2019 American buddy action comedy film directed by David Leitch and written by Chris Morgan and Drew Pearce, from a story by Morgan. It is the first spin-off of the Fast & Furious franchise, and is set following the events of The Fate of the Furious (2017) and before the events of F9 (2021). It stars Dwayne Johnson, Jason Statham, Idris Elba, Vanessa Kirby, Eiza González, Cliff Curtis, and Helen Mirren. In the film, the unlikely pairing of Luke Hobbs (Johnson) and Deckard Shaw (Statham) join Deckard's sister Hattie (Kirby) to take down Brixton Lore (Elba), a cybernetically enhanced terrorist threatening the world with a deadly virus.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/00/Fast_%26_Furious_Presents_Hobbs_%26_Shaw_-_theatrical_poster.jpg",
        "thumbnail_width": 251,
        "thumbnail_height": 397
      },
      {
        "title": "The Lion King",
        "year": 2019,
        "cast": [
          "Donald Glover",
          "Seth Rogen",
          "Chiwetel Ejiofor",
          "Alfre Woodard",
          "Billy Eichner",
          "John Kani",
          "John Oliver",
          "Beyoncé Knowles-Carter",
          "James Earl Jones"
        ],
        "genres": [
          "Drama",
          "Musical"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Lion%20King%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "The Lion King is a 2019 American musical drama film directed and produced by Jon Favreau, written by Jeff Nathanson, and produced by Walt Disney Pictures and Fairview Entertainment. It is a photorealistic computer-animated remake of Disney's traditionally animated 1994 film of the same name. The film stars the voices of Donald Glover, Seth Rogen, Chiwetel Ejiofor, Alfre Woodard, Billy Eichner, John Kani, John Oliver, Florence Kasumba, Eric André, Keegan-Michael Key, JD McCrary, Shahadi Wright Joseph, and Beyoncé Knowles-Carter, as well as James Earl Jones reprising his role from the original film. The plot follows Simba, a young lion who must embrace his role as the rightful king of his homeland following the murder of his father, Mufasa, at the hands of his uncle, Scar.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9d/Disney_The_Lion_King_2019.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Scary Stories to Tell in the Dark",
        "year": 2019,
        "cast": [
          "Zoe Colletti",
          "Michael Garza",
          "Gabriel Rush",
          "Austin Zajur",
          "Natalie Ganzhorn",
          "Austin Abrams",
          "Dean Norris",
          "Gil Bellows",
          "Lorraine Toussaint"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Scary%20Stories%20to%20Tell%20in%20the%20Dark%20by%20Vj%20Emmy.mp4",
        "extract": "Scary Stories to Tell in the Dark is a 2019 horror film directed by André Øvredal, based on the children's book series of the same name by Alvin Schwartz. The screenplay was adapted by The Hageman Brothers, from a screen story by producer Guillermo del Toro, as well as Patrick Melton and Marcus Dunstan. The film, an international co-production of the United States and Canada, stars Zoe Colletti, Michael Garza, Gabriel Rush, Austin Zajur, Natalie Ganzhorn, Austin Abrams, Dean Norris, Gil Bellows, and Lorraine Toussaint.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/dd/Scary_Stories_to_Tell_in_the_Dark_film_logo.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "Dora and the Lost City of Gold by Vj Emmy",
        "year": 2019,
        "cast": [
          "Isabela Moner",
          "Eugenio Derbez",
          "Michael Peña",
          "Eva Longoria",
          "Temuera Morrison",
          "Danny Trejo",
          "Benicio del Toro"
        ],
        "genres": [
          "Adventure",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Dora%20and%20the%20lost%20city%20of%20gold%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Dora and the Lost City of Gold is a 2019 American adventure comedy film directed by James Bobin. It is a live-action adaptation of the Nick Jr. Channel animated television series Dora the Explorer as well as the Nickelodeon animated series Dora and Friends. The film stars Isabela Moner, Eugenio Derbez, Michael Peña, Eva Longoria, with Danny Trejo as the voice of Boots. The titular Lost City of Gold is based on the legendary Inca city, Paititi. Dora and the Lost City of Gold was produced by Paramount Players and Nickelodeon Movies in association with Walden Media, MRC and Burr! Productions, and distributed by Paramount Pictures.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/29/Dora_and_the_Lost_City_of_Gold_poster.jpg",
        "thumbnail_width": 253,
        "thumbnail_height": 395
      },
      {
        "title": "Dora and the Lost City of Gold by Vj Junior",
        "year": 2019,
        "cast": [
          "Isabela Moner",
          "Eugenio Derbez",
          "Michael Peña",
          "Eva Longoria",
          "Temuera Morrison",
          "Danny Trejo",
          "Benicio del Toro"
        ],
        "genres": [
          "Adventure",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Dora%20and%20the%20lost%20city%20of%20gold%20-%20VJ%20Junior%20-%20Mobifliks.mp4",
        "extract": "Dora and the Lost City of Gold is a 2019 American adventure comedy film directed by James Bobin. It is a live-action adaptation of the Nick Jr. Channel animated television series Dora the Explorer as well as the Nickelodeon animated series Dora and Friends. The film stars Isabela Moner, Eugenio Derbez, Michael Peña, Eva Longoria, with Danny Trejo as the voice of Boots. The titular Lost City of Gold is based on the legendary Inca city, Paititi. Dora and the Lost City of Gold was produced by Paramount Players and Nickelodeon Movies in association with Walden Media, MRC and Burr! Productions, and distributed by Paramount Pictures.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/29/Dora_and_the_Lost_City_of_Gold_poster.jpg",
        "thumbnail_width": 253,
        "thumbnail_height": 395
      },
      {
        "title": "The Kitchen",
        "year": 2019,
        "cast": [
          "Melissa McCarthy",
          "Tiffany Haddish",
          "Elisabeth Moss",
          "Domhnall Gleeson",
          "James Badge Dale",
          "Brian d'Arcy James",
          "Margo Martindale",
          "Common",
          "Bill Camp"
        ],
        "genres": [
          "Crime"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Kitchen%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "The Kitchen is a 2019 American crime film written and directed by Andrea Berloff in her directorial debut. It is based on the DC/Vertigo Comics limited series of the same name by Ollie Masters and Ming Doyle. The film stars Melissa McCarthy, Tiffany Haddish, and Elisabeth Moss as the wives of Irish American mobsters who take over organized crime operations in New York's Hell's Kitchen in the late 1970s, after the FBI arrests their husbands. The film also features Domhnall Gleeson, James Badge Dale, Brian d'Arcy James, Jeremy Bobb, Margo Martindale, Common, and Bill Camp in supporting roles.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/5c/The_Kitchen_poster.jpeg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "After the Wedding",
        "year": 2019,
        "cast": [
          "Michelle Williams",
          "Julianne Moore",
          "Billy Crudup",
          "Abby Quinn"
        ],
        "genres": [
          "Drama"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/After%20The%20Wedding%20-%20VJ%20Junior%20-%20Mobifliks.mp4",
        "extract": "After the Wedding is a 2019 American drama film written and directed by Bart Freundlich. It is a remake of the Danish-Swedish 2006 film of the same name by Susanne Bier. It stars Julianne Moore, Michelle Williams, Billy Crudup, and Abby Quinn.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9a/After_the_Wedding_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Ready or Not by Vj Jingo",
        "year": 2019,
        "cast": [
          "Samara Weaving",
          "Adam Brody",
          "Mark O'Brien",
          "Henry Czerny",
          "Andie MacDowell"
        ],
        "genres": [
          "Comedy",
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Ready%20or%20Not%20-%20VJ%20Jingo%20-%20Mobifliks.com.mp4",
        "extract": "Ready or Not is a 2019 American black comedy horror film directed by Matt Bettinelli-Olpin and Tyler Gillett and written by Guy Busick and R. Christopher Murphy. It stars Samara Weaving, Adam Brody, Mark O'Brien, Henry Czerny, and Andie MacDowell. It follows Grace (Weaving), a newlywed who is hunted by her spouse's wealthy Satan-worshipping family as part of a wedding night ritual.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/7b/Ready_or_Not_2019_film_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 328
      },
      {
        "title": "Ready or Not by Vj Emmy",
        "year": 2019,
        "cast": [
          "Samara Weaving",
          "Adam Brody",
          "Mark O'Brien",
          "Henry Czerny",
          "Andie MacDowell"
        ],
        "genres": [
          "Comedy",
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Ready%20or%20not%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Ready or Not is a 2019 American black comedy horror film directed by Matt Bettinelli-Olpin and Tyler Gillett and written by Guy Busick and R. Christopher Murphy. It stars Samara Weaving, Adam Brody, Mark O'Brien, Henry Czerny, and Andie MacDowell. It follows Grace (Weaving), a newlywed who is hunted by her spouse's wealthy Satan-worshipping family as part of a wedding night ritual.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/7b/Ready_or_Not_2019_film_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 328
      },
      {
        "title": "47 Meters Down: Uncaged",
        "year": 2019,
        "cast": [
          "John Corbett",
          "Nia Long",
          "Sophie Nelisse",
          "Corinne Foxx",
          "Sistine Stallone",
          "Brianne Tju",
          "Davi Santos",
          "Khylin Rhambo",
          "Brec Bassinger"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/47%20Meters%20Down%20Uncaged%20-%20VJ%20Emmy%20-%20Luganda.mp4",
        "extract": "47 Meters Down: Uncaged is a 2019 survival horror film directed by Johannes Roberts and written by Roberts and Ernest Riera, and a sequel to 47 Meters Down (2017).",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/84/47MetersDownUncaged.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Angel Has Fallen",
        "year": 2019,
        "cast": [
          "Gerard Butler",
          "Morgan Freeman",
          "Jada Pinkett Smith",
          "Nick Nolte",
          "Lance Reddick",
          "Danny Huston",
          "Tim Blake Nelson"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Angel%20has%20fallen%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Angel Has Fallen is a 2019 American action thriller film directed by Ric Roman Waugh. It is the third installment in the Has Fallen film series, following Olympus Has Fallen (2013) and London Has Fallen (2016). The film stars Gerard Butler, Morgan Freeman, Jada Pinkett Smith, Lance Reddick, Tim Blake Nelson, Piper Perabo, Nick Nolte, and Danny Huston. The plot again follows United States Secret Service agent Mike Banning as he races against time to clear his name after being framed for a drone attack on the President of the United States, Allan Trumbull.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/13/Angel_Has_Fallen_poster.jpg",
        "thumbnail_width": 250,
        "thumbnail_height": 370
      },
      {
        "title": "Rambo: Last Blood",
        "year": 2019,
        "cast": [
          "Sylvester Stallone",
          "Adriana Barraza",
          "Paz Vega",
          "Yvette Monreal",
          "Sergio Peris-Mencheta",
          "Oscar Jaenada",
          "Joaquín Cosío"
        ],
        "genres": [
          "Action"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Rambo%20Last%20Blood%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Rambo: Last Blood is a 2019 American action film directed by Adrian Grünberg. The screenplay was co-written by Matthew Cirulnick and Sylvester Stallone, from a story by Dan Gordon and Stallone, and is based on the character John Rambo created by author David Morrell for his novel First Blood. A sequel to Rambo (2008), it is the fifth installment in the Rambo franchise and stars Stallone as Rambo, alongside Paz Vega, Sergio Peris-Mencheta, Adriana Barraza, Yvette Monreal, Genie Kim aka Yenah Han, Joaquín Cosío, and Oscar Jaenada. In the film, Rambo travels to Mexico to save his adopted niece, who has been kidnapped by a Mexican cartel and forced into prostitution.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b1/Rambo_-_Last_Blood_official_theatrical_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 325
      },
      
      {
        "title": "Hustlers",
        "year": 2019,
        "cast": [
          "Constance Wu",
          "Jennifer Lopez",
          "Julia Stiles",
          "Keke Palmer",
          "Lili Reinhart",
          "Lizzo",
          "Cardi B"
        ],
        "genres": [
          "Comedy",
          "Crime",
          "Drama"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Hustlers%20by%20Vj%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Hustlers is a 2019 American crime comedy-drama film written and directed by Lorene Scafaria, based on New York magazine's 2015 article \"The Hustlers at Scores\" by Jessica Pressler. The film stars Constance Wu, Jennifer Lopez, Julia Stiles, Keke Palmer, Lili Reinhart, Lizzo, and Cardi B. It follows a crew of New York City strippers who begin to steal money by drugging stock traders and CEOs who visit their club, then running up their credit cards. Lopez also served as a producer on the film through Nuyorican Productions, alongside Jessica Elbaum, Will Ferrell, and Adam McKay through their Gloria Sanchez banner.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/d9/Hustlers_%28Official_Film_Poster%29.png",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Strange but True",
        "year": 2019,
        "cast": [
          "Amy Ryan",
          "Nick Robinson",
          "Margaret Qualley",
          "Connor Jessup",
          "Blythe Danner",
          "Brian Cox",
          "Greg Kinnear"
        ],
        "genres": [
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Strange%20but%20true_VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Strange but True is a 2019 American thriller film directed by Rowan Athale from a screenplay by Eric Garcia. The film is an adaptation of the 2004 novel of the same name by John Searles and stars Amy Ryan, Nick Robinson, Margaret Qualley, Blythe Danner, Brian Cox, Greg Kinnear and Connor Jessup.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/58/Strange_but_True_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Running with the Devil",
        "year": 2019,
        "cast": [
          "Nicolas Cage",
          "Laurence Fishburne"
        ],
        "genres": [
          "Crime",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Running%20with%20the%20Devil_VJ%20Junior_Mobifliks.com.mp4",
        "extract": "Running with the Devil is a 2019 American crime thriller film written and directed by Jason Cabell and starring Nicolas Cage, Laurence Fishburne, Leslie Bibb and Barry Pepper. It is Cabell's directorial debut.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/25/Running_with_the_Devil_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "Fractured",
        "year": 2019,
        "cast": [
          "Sam Worthington",
          "Lily Rabe",
          "Stephen Tobolowsky"
        ],
        "genres": [
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Fractured_VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Fractured is a 2019 American psychological thriller film directed by Brad Anderson from a screenplay by Alan B. McElroy. It stars Sam Worthington, Lily Rabe, Stephen Tobolowsky, Adjoa Andoh, and Lucy Capri.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8c/Fracture_poster.jpeg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Abominable",
        "year": 2019,
        "cast": [
          "Chloe Bennet",
          "Albert Tsai",
          "Tenzing Norgay Trainor",
          "Eddie Izzard",
          "Sarah Paulson"
        ],
        "genres": [
          "Adventure",
          "Animated"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Abominable%20-%20VJ%20Kevo%20-%20Mobifliks.com.mp4)",
        "extract": "Abominable is a 2019 computer-animated adventure film produced by DreamWorks Animation and Pearl Studio, written and directed by Jill Culton and co-directed by Todd Wilderman, and stars the voices of Chloe Bennet, Albert Tsai, Tenzing Norgay Trainor, Eddie Izzard, Sarah Paulson, Tsai Chin, and Michelle Wong. The film follows a teenage girl named Yi, who encounters a young Yeti on the roof of her apartment building in Shanghai, names him Everest and embarks on an epic quest to reunite the magical creature with his family at the highest point on Earth along with her mischievous friends Jin and Peng, but the trio of friends will have to stay one-step ahead of Burnish, a wealthy man intent on capturing a Yeti, and zoologist Dr. Zara to help Everest get home.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/10/Abominable_%282019_poster%29.png",
        "thumbnail_width": 240,
        "thumbnail_height": 380
      },
      {
        "title": "Joker",
        "year": 2019,
        "cast": [
          "Joaquin Phoenix",
          "Robert De Niro",
          "Zazie Beetz",
          "Frances Conroy",
          "Brett Cullen",
          "Glenn Fleshler",
          "Bill Camp",
          "Shea Whigham",
          "Marc Maron"
        ],
        "genres": [
          "Thriller"
        ],
        "href": "Joker_(2019_film)",
        "extract": "Joker is a 2019 American psychological thriller film directed by Todd Phillips, who also co-wrote the screenplay with Scott Silver. The film, based on DC Comics characters, stars Joaquin Phoenix as the Joker and serves as a standalone origin story for the character. Set in 1981, it follows Arthur Fleck, a failed clown and aspiring stand-up comic whose descent into mental illness and nihilism inspires a violent countercultural revolution against the prosperous in a decaying Gotham City. Robert De Niro, Zazie Beetz and Frances Conroy appear in supporting roles. Distributed by Warner Bros. Pictures, Joker was produced by Warner Bros. Pictures and DC Films in association with Village Roadshow Pictures, Bron Creative and Joint Effort.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e1/Joker_%282019_film%29_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "Maleficent: Mistress of Evil",
        "year": 2019,
        "cast": [
          "Angelina Jolie",
          "Elle Fanning",
          "Michelle Pfeiffer",
          "Chiwetel Ejiofor",
          "Sam Riley",
          "Harris Dickinson",
          "Ed Skrein",
          "Imelda Staunton",
          "Juno Temple",
          "Lesley Manville"
        ],
        "genres": [
          "Fantasy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Maleficent%20-%20Mistress%20of%20Evil_VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Maleficent: Mistress of Evil is a 2019 American fantasy film produced by Walt Disney Pictures. Directed by Joachim Rønning from a screenplay written by Linda Woolverton, Micah Fitzerman-Blue and Noah Harpster, it is a sequel to Maleficent (2014), with Angelina Jolie returning to portray the title role. Elle Fanning, Sam Riley, Imelda Staunton, Juno Temple, and Lesley Manville also return to their previous roles, with Harris Dickinson replacing Brenton Thwaites from the first film and Chiwetel Ejiofor, Ed Skrein, and Michelle Pfeiffer joining the cast as new characters. Set five years after Maleficent, the film sees the eponymous character face the neighboring kingdom's manipulated perception of herself as a villain, in addition to a subplot of the rise of an endangered, powerful fairy race known as the Dark Fae.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/7b/Maleficent_Mistress_of_Evil_%28Official_Film_Poster%29.png",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Jexi",
        "year": 2019,
        "cast": [
          "Adam Devine",
          "Rose Byrne",
          "Alexandra Shipp",
          "Ron Funches",
          "Charlyne Yi",
          "Wanda Sykes",
          "Justin Hartley",
          "Kid Cudi",
          "Michael Peña"
        ],
        "genres": [
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Jexi%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Jexi is a 2019 comedy film written and directed by Jon Lucas and Scott Moore. The film stars Adam DeVine, Alexandra Shipp, Michael Peña, Rose Byrne, Justin Hartley, Wanda Sykes, Ron Funches, and Charlyne Yi. The plot follows a self-aware smartphone that becomes emotionally attached to its socially awkward owner.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/55/JexiPoster.jpeg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Polaroid",
        "year": 2019,
        "cast": [
          "Kathryn Prescott",
          "Grace Zabriskie",
          "Samantha Logan",
          "Tyler Young",
          "Javier Botet",
          "Katie Stevens",
          "Madelaine Petsch"
        ],
        "genres": [
          "Horror",
          "Short",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Polaroid%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Polaroid is a 2019 American supernatural horror film directed by Lars Klevberg, and based on his 2015 short film of the same name. The film follows high schooler Bird Fitcher, who is given a vintage Polaroid camera that holds dark and mysterious secrets. She soon realizes that those who get their picture taken by it meet a tragic death. It stars Kathryn Prescott, Samantha Logan, Tyler Young, and Javier Botet.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4d/Polaroid_teaser_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 311
      },
      {
        "title": "Little Monsters",
        "year": 2019,
        "cast": [
          "Lupita Nyong'o",
          "Alexander England",
          "Josh Gad"
        ],
        "genres": [
          "Comedy",
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Little%20Monsters_VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Little Monsters is a 2019 zombie comedy film written and directed by Abe Forsythe, starring Lupita Nyong'o, Alexander England, Josh Gad, and Kat Stewart. The story centres on a washed-up musician, a children's television personality, and a kindergarten teacher teaming up to protect a group of young schoolchildren during a sudden zombie outbreak.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4b/Littlemonsters2019poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Gemini Man",
        "year": 2019,
        "cast": [
          "Will Smith",
          "Mary Elizabeth Winstead",
          "Clive Owen",
          "Benedict Wong"
        ],
        "genres": [
          "Action",
          "Science Fiction",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Gemini%20Man%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Gemini Man is a 2019 American science fiction action thriller film directed by Ang Lee. Starring Will Smith in the main role, Mary Elizabeth Winstead, Clive Owen, and Benedict Wong, the film follows a retiring Force Recon Marine Scout Sniper who is targeted by a much younger clone of himself while on the run from a corrupt private military company.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/5b/GeminiManPoster.jpeg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "The Addams Family",
        "year": 2019,
        "cast": [
          "Oscar Isaac",
          "Charlize Theron",
          "Chloë Grace Moretz",
          "Finn Wolfhard",
          "Nick Kroll",
          "Snoop Dogg",
          "Bette Midler",
          "Allison Janney"
        ],
        "genres": [
          "Animated",
          "Comedy",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Adams%20Family_VJ%20Kevo-Mobifliks.com.mp4",
        "extract": "The Addams Family is a 2019 computer-animated supernatural black comedy film directed by Conrad Vernon and Greg Tiernan and based on the characters created by Charles Addams. The film stars the voices of Oscar Isaac, Charlize Theron, Chloë Grace Moretz, Finn Wolfhard, Nick Kroll, Snoop Dogg, Bette Midler, and Allison Janney.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/39/The_Addams_Family_%282019_film%29.png",
        "thumbnail_width": 240,
        "thumbnail_height": 356
      },
      {
        "title": "In the Tall Grass",
        "year": 2019,
        "cast": [
          "Patrick Wilson",
          "Harrison Gilbertson",
          "Rachel Wilson"
        ],
        "genres": [
          "Drama",
          "Horror",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/In%20the%20tall%20grass_VJ%20Emmy_Mobifliks.com.mp4",
        "extract": "In the Tall Grass is a 2019 Canadian supernatural horror drama film written and directed by Vincenzo Natali. It is based on Stephen King and Joe Hill's 2012 novella of the same name. It stars Harrison Gilbertson, Laysla De Oliveira, Avery Whitted, Will Buie Jr., Rachel Wilson, and Patrick Wilson.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8a/In_the_Tall_Grass_poster.jpeg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Countdown",
        "year": 2019,
        "cast": [
          "Elizabeth Lail",
          "Peter Facinelli",
          "Anne Winters",
          "Talitha Bateman",
          "Tichina Arnold",
          "P. J. Byrne"
        ],
        "genres": [
          "Horror",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Countdown%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Countdown is a 2019 American supernatural horror film directed and written by Justin Dec, and starring Elizabeth Lail, Jordan Calloway, Talitha Bateman, Tichina Arnold, P.J. Byrne, Peter Facinelli, Anne Winters, and Tom Segura. The plot follows a group of people who discover a mobile app that correctly tells its users when they are going to die.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a8/Countdown2019MoviePoster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Black and Blue",
        "year": 2019,
        "cast": [
          "Naomie Harris",
          "Tyrese Gibson",
          "Frank Grillo",
          "Mike Colter",
          "Reid Scott",
          "Beau Knapp"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Black%20and%20Blue_VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Black and Blue is a 2019 American action thriller film directed by Deon Taylor from a screenplay by Peter A. Dowling. The film stars Naomie Harris, Tyrese Gibson, Frank Grillo, Mike Colter, Reid Scott, and Beau Knapp, and follows a rookie police officer who goes on the run after she witnesses her colleagues commit a murder.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/ab/Black_and_Blue_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Trauma Center",
        "year": 2019,
        "cast": [
          "Bruce Willis",
          "Nicky Whelan"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Trauma%20Center_VJ%20Junior_Mobifliks.com.mp4",
        "extract": "Trauma Center is a 2019 American action thriller film directed by Matt Eskandari. The film stars Bruce Willis and Nicky Whelan.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bc/Trauma_center.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Jumanji: The Next Level",
        "year": 2019,
        "cast": [
          "Dwayne Johnson",
          "Jack Black",
          "Kevin Hart",
          "Karen Gillan",
          "Nick Jonas",
          "Awkwafina",
          "Rory McCann",
          "Alex Wolff",
          "Morgan Turner",
          "Ser'Darius Blain",
          "Madison Iseman",
          "Danny Glover",
          "Danny DeVito"
        ],
        "genres": [
          "Adventure",
          "Comedy",
          "Fantasy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Jumanji.the.next.level.mobifiliks.com.422mb.mp4",
        "extract": "Jumanji: The Next Level is a 2019 American fantasy adventure comedy film directed by Jake Kasdan, who co-wrote the script with Jeff Pinkner and Scott Rosenberg. The film is the fourth installment in the Jumanji film series and the sequel to Jumanji: Welcome to the Jungle (2017). It stars Dwayne Johnson, Jack Black, Kevin Hart, Karen Gillan, Nick Jonas, Alex Wolff, Morgan Turner, Ser'Darius Blain, and Madison Iseman reprising their roles from the previous film, while Awkwafina, Danny Glover, and Danny DeVito join the cast. The film's plot takes place two years after Welcome to the Jungle, in which the same group of teenagers, along with an old friend and two unwitting additions, become trapped in Jumanji once again. There, they all find themselves facing new problems and challenges with both old and new avatars, while having to save the land from a new villain to escape.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/12/Jumanji_-The_Next_Level_film_poster.jpg",
        "thumbnail_width": 258,
        "thumbnail_height": 391
      },
      {
        "title": "Queen & Slim",
        "year": 2019,
        "cast": [
          "Daniel Kaluuya",
          "Jodie Turner-Smith",
          "Bokeem Woodbine",
          "Chloë Sevigny",
          "Flea",
          "Sturgill Simpson",
          "Indya Moore"
        ],
        "genres": [
          "Crime",
          "Drama",
          "Romance"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Queen%20and%20Slim%20-%20VJ%20Lance%20-%20Mobifliks.com.mp4",
        "extract": "Queen & Slim is a 2019 American romantic road crime drama film directed by Melina Matsoukas and with a screenplay by Lena Waithe from a story by James Frey and Waithe. The film's tells the story of a young couple who go on the run after killing a police officer in the heat of an argument as self-defense during a traffic stop. Bokeem Woodbine, Chloë Sevigny, Flea, Sturgill Simpson and Indya Moore also star.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/d2/Queen_%26_Slim_poster.jpeg",
        "thumbnail_width": 268,
        "thumbnail_height": 372
      },
      {
        "title": "21 Bridges",
        "year": 2019,
        "cast": [
          "Chadwick Boseman",
          "Sienna Miller",
          "Stephan James",
          "Keith David",
          "Taylor Kitsch",
          "J.K. Simmons"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/21%20Bridges%20-%20VJ%20Jingo%20-%20Mobifliks.com.mp4",
        "extract": "21 Bridges is a 2019 American action thriller film directed by Brian Kirk and written by Adam Mervis and Matthew Michael Carnahan, based on a story by Mervis. The film stars Chadwick Boseman as an NYPD Detective who shuts down the 21 river crossings of Manhattan to find two suspected cop killers, portrayed by Stephan James and Taylor Kitsch. Sienna Miller, Keith David and J. K. Simmons appear in supporting roles. The film was produced by brothers Joe and Anthony Russo, Mike Larocca, Robert Simonds, Gigi Pritzker, Boseman and Logan Coles.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/72/21BridgesPoster.jpeg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "The Report",
        "year": 2019,
        "cast": [
          "Adam Driver",
          "Annette Bening",
          "Ted Levine",
          "Michael C. Hall",
          "Tim Blake Nelson",
          "Corey Stoll",
          "Maura Tierney",
          "Jon Hamm"
        ],
        "genres": [
          "Historical",
          "Drama",
          "Political"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Report%20by%20Vj%20Muba%20-%20Mobifliks.com.mp4",
        "extract": "The Report is a 2019 American historical / political drama film written and directed by Scott Z. Burns that stars Adam Driver, Annette Bening, Ted Levine, Michael C. Hall, Tim Blake Nelson, Corey Stoll, Maura Tierney, and Jon Hamm. The plot follows staffer Daniel Jones and the Senate Intelligence Committee as they investigate the Central Intelligence Agency's use of torture following the September 11th attacks. It covers more than a decade's worth of real-life political intrigue, exploring and compacting Jones's 6,700-page report. It is partly based on the article \"Rorschach and Awe\" by American journalist Katherine Eban; that publication was originally distributed by the magazine Vanity Fair in July 2007.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/80/The_Report_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Charlie's Angels",
        "year": 2019,
        "cast": [
          "Kristen Stewart",
          "Naomi Scott",
          "Ella Balinska",
          "Elizabeth Banks",
          "Djimon Hounsou",
          "Sam Claflin",
          "Noah Centineo",
          "Nat Faxon",
          "Patrick Stewart"
        ],
        "genres": [
          "Action",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Charlies%20Angels_VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Charlie's Angels is a 2019 American action comedy film written and directed by Elizabeth Banks from a story by Evan Spiliotopoulos and David Auburn. It stars Kristen Stewart, Naomi Scott, and Ella Balinska as the new generation of Angels who are working for a private detective agency named the Townsend Agency. The film is the third installment in the Charlie's Angels film series and serves as a continuation of the story that began with the television series of the same name by Ivan Goff and Ben Roberts, and the two previous theatrical films, Charlie's Angels (2000) and Charlie's Angels: Full Throttle (2003).",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/2a/Charlie%27s_Angels_%28Official_2019_Film_Poster%29.png",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Midway by Vj Emmy",
        "year": 2019,
        "cast": [
          "Ed Skrein",
          "Patrick Wilson",
          "Luke Evans",
          "Aaron Eckhart",
          "Nick Jonas",
          "Mandy Moore",
          "Dennis Quaid",
          "Woody Harrelson",
          "Tadanobu Asano",
          "Darren Criss"
        ],
        "genres": [
          "War"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Midway%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Midway is a 2019 war film about the Battle of Midway, a turning point in the Pacific Theater of World War II. The film was directed by Roland Emmerich, who also produced the film with Harald Kloser, and was written by Wes Tooke. The film stars Ed Skrein, Patrick Wilson, Luke Evans, Aaron Eckhart, Nick Jonas, Mandy Moore, Dennis Quaid, Tadanobu Asano, Darren Criss, and Woody Harrelson.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/55/Midway_Movie_HD_Poster.jpeg",
        "thumbnail_width": 254,
        "thumbnail_height": 376
      },
      {
        "title": "Midway by Vj Junior",
        "year": 2019,
        "cast": [
          "Ed Skrein",
          "Patrick Wilson",
          "Luke Evans",
          "Aaron Eckhart",
          "Nick Jonas",
          "Mandy Moore",
          "Dennis Quaid",
          "Woody Harrelson",
          "Tadanobu Asano",
          "Darren Criss"
        ],
        "genres": [
          "War"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Midway%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Midway is a 2019 war film about the Battle of Midway, a turning point in the Pacific Theater of World War II. The film was directed by Roland Emmerich, who also produced the film with Harald Kloser, and was written by Wes Tooke. The film stars Ed Skrein, Patrick Wilson, Luke Evans, Aaron Eckhart, Nick Jonas, Mandy Moore, Dennis Quaid, Tadanobu Asano, Darren Criss, and Woody Harrelson.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/55/Midway_Movie_HD_Poster.jpeg",
        "thumbnail_width": 254,
        "thumbnail_height": 376
      },
      {
        "title": "Playing with Fire",
        "year": 2019,
        "cast": [
          "John Cena",
          "Keegan-Michael Key",
          "John Leguizamo",
          "Brianna Hildebrand",
          "Dennis Haysbert",
          "Judy Greer"
        ],
        "genres": [
          "Comedy",
          "Family"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Playing%20With%20Fire%20by%20Vj%20Lance%20-%20Mobifliks.com.mp4",
        "extract": "Playing with Fire is a 2019 American family comedy film directed by Andy Fickman from a screenplay by Dan Ewen and Matt Lieberman based on a story by Ewen. The film stars John Cena, Keegan-Michael Key, John Leguizamo, Brianna Hildebrand, Dennis Haysbert, and Judy Greer. It tells the story of a group of smokejumpers who must watch over three children who they rescued from a burning cabin until child services arrives.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1b/Playing_With_Fire_Movie_HD_Poster.jpeg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Harriet",
        "year": 2019,
        "cast": [
          "Cynthia Erivo",
          "Leslie Odom Jr.",
          "Joe Alwyn",
          "Janelle Monáe"
        ],
        "genres": [
          "Biography"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Harriet%20-%20VJ%20Lance%20-%20Mobifliks.com.mp4",
        "extract": "Harriet is a 2019 American biographical film directed by Kasi Lemmons, who also wrote the screenplay with Gregory Allen Howard. It stars Cynthia Erivo as abolitionist Harriet Tubman, with Leslie Odom Jr., Joe Alwyn, and Janelle Monáe in supporting roles. A biography about Harriet Tubman had been in the works for years, with several actresses, including Viola Davis, rumored to star. Erivo was cast in February 2017, and much of the cast and crew joined the following year. Filming took place in Virginia from October to December 2018.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/01/HarrietFilmPoster.jpeg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "1917",
        "year": 2019,
        "cast": [
          "George MacKay",
          "Dean-Charles Chapman",
          "Mark Strong",
          "Andrew Scott",
          "Richard Madden",
          "Claire Duburcq",
          "Colin Firth",
          "Benedict Cumberbatch"
        ],
        "genres": [
          "War"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/1917%20-%20VJ%20Lance%20-%20Mobifliks.com.mp4",
        "extract": "1917 is a 2019 British war film directed and produced by Sam Mendes, who co-wrote the film with Krysty Wilson-Cairns. Partially inspired by stories told to Mendes by his paternal grandfather Alfred about his service during World War I, the film takes place after the German retreat to the Hindenburg Line during Operation Alberich, and follows two British soldiers, Will Schofield and Tom Blake, in their mission to deliver an important message to call off a doomed offensive attack. Mark Strong, Andrew Scott, Richard Madden, Claire Duburcq, Colin Firth, and Benedict Cumberbatch also star in supporting roles.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/f/fe/1917_%282019%29_Film_Poster.jpeg/320px-1917_%282019%29_Film_Poster.jpeg",
        "thumbnail_width": 320,
        "thumbnail_height": 240
      },
      {
        "title": "Just Mercy",
        "year": 2019,
        "cast": [
          "Michael B. Jordan",
          "Jamie Foxx",
          "Brie Larson",
          "Rob Morgan",
          "Tim Blake Nelson",
          "Rafe Spall",
          "O'Shea Jackson Jr.",
          "C.J. LeBlanc"
        ],
        "genres": [
          "Drama",
          "Legal",
          "Biography"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Just%20Mercy%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Just Mercy is a 2019 American biographical legal drama film co-written and directed by Destin Daniel Cretton and starring Michael B. Jordan as Bryan Stevenson, Jamie Foxx as Walter McMillian, Rob Morgan, Tim Blake Nelson, Rafe Spall, and Brie Larson. It explores the work of young defense attorney Bryan Stevenson who represents poor people on death row in the South. Featured is his work with Walter McMillian, who had been wrongfully convicted of the murder of a young woman. The film is based on Stevenson's 2014 eponymous memoir, in which he explored his journey to making his life's work the defense of African American prisoners.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1b/Just_Mercy_Official_Poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "Spies in Disguise",
        "year": 2019,
        "cast": [
          "Will Smith",
          "Tom Holland",
          "Rashida Jones",
          "Ben Mendelsohn",
          "Reba McEntire",
          "Rachel Brosnahan",
          "Karen Gillan",
          "DJ Khaled",
          "Masi Oka"
        ],
        "genres": [
          "Animated",
          "Comedy",
          "Spy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Spies%20in%20Disguise%20-%20VJ%20Kevo%20-%20Mobifliks.com.mp4",
        "extract": "Spies in Disguise is a 2019 American computer-animated spy comedy film produced by Blue Sky Studios and distributed by 20th Century Fox. Loosely inspired by the 2009 animated short Pigeon: Impossible by Lucas Martell, the film is directed by Troy Quane and Nick Bruno from a screenplay by Brad Copeland and Lloyd Taylor, and a story by Cindy Davis. It stars the voices of Will Smith and Tom Holland, alongside Rashida Jones, Ben Mendelsohn, Reba McEntire, Rachel Brosnahan, Karen Gillan, DJ Khaled, and Masi Oka in supporting roles. The plot follows a secret agent who is transformed into a pigeon by an intelligent young scientist; the two must then work together to stop a revenge-seeking cybernetic terrorist, and return the agent to his human form.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f7/Spies_in_Disguise_Final_Poster.jpeg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
     
    
     
      {
        "title": "Five Feet Apart",
        "year": 2019,
        "cast": [
          "Cole Sprouse",
          "Haley Lu Richardson"
        ],
        "genres": [
          "Drama",
          "Romance"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Five%20Feet%20Apart_VJ%20Junior_Luganda_Mobifliks.com.mp4",
        "extract": "Five Feet Apart is a 2019 American romantic drama film directed by Justin Baldoni and written by Mikki Daughtry and Tobias Iaconis. The film was inspired by Claire Wineland, who suffered from cystic fibrosis. Haley Lu Richardson and Cole Sprouse play two young patients with cystic fibrosis who try to have a relationship despite being forced to stay six feet apart from each other. The film was released in the United States on March 15, 2019 by CBS Films via Lionsgate. It received mixed reviews from critics and grossed $92 million worldwide.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a7/Five_Feet_Apart_%282019_poster%29.png",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "The Highwaymen",
        "year": 2019,
        "cast": [
          "Kevin Costner",
          "Woody Harrelson",
          "Kathy Bates",
          "John Carroll Lynch",
          "Kim Dickens",
          "Thomas Mann",
          "William Sadler"
        ],
        "genres": [
          "Crime",
          "Thriller",
          "Historical"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Highway%20Men%20-%20VJ%20Emmy_mobifliks.com.mp4",
        "extract": "The Highwaymen is a 2019 American period crime thriller film directed by John Lee Hancock and written by John Fusco. The film stars Kevin Costner and Woody Harrelson as Frank Hamer and Maney Gault, two former Texas Rangers who attempt to track down and apprehend notorious criminals Bonnie and Clyde in the 1930s. Kathy Bates, John Carroll Lynch, Kim Dickens, Thomas Mann and William Sadler also star.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/62/The_Highwaymen_film_poster.jpeg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "The Upside",
        "year": 2019,
        "cast": [
          "Bryan Cranston",
          "Kevin Hart",
          "Nicole Kidman"
        ],
        "genres": [
          "Comedy",
          "Drama"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Upside%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "The Upside is a 2017 American comedy-drama film directed by Neil Burger, written by Jon Hartmere. It is a remake of the French 2011 film The Intouchables, which was itself inspired by the lives of Abdel Sallou and Philippe Pozzo di Borgo. The film follows a paralyzed billionaire who strikes up an unlikely friendship with a recently paroled convict whom he hires to take care of him. Nicole Kidman, Golshifteh Farahani, and Julianna Margulies also star. It is the third remake of The Intouchables after the Indian film Oopiri, and the Argentinian film Inseparables (2016).",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/83/The_Upside.png",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Replicas",
        "year": 2019,
        "cast": [
          "Keanu Reeves"
        ],
        "genres": [
          "Science Fiction",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Replicas%20-%20Luganda_www.mobifliks.com.mp4",
        "extract": "Replicas is a 2018 American science fiction thriller film directed by Jeffrey Nachmanoff, and written by Chad St. John, from a story by Stephen Hamel. The film tells the story of a neuroscientist who violates the law and bioethics to bring his family members back to life after they die in a car accident. It stars Keanu Reeves, Alice Eve and Thomas Middleditch.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c9/Replicas_poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      }
]